prefix_sum.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Prefix Sum</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css">

</head>
<body>
<!--  --><nav><span class="nav-header">Problem Solving</span><span class="nav-items"><a href="index.html">Home</a><span></nav><div id="content" class="content">
<h1 class="title">Prefix Sum</h1>

<div id="outline-container-orgd71ae45" class="outline-2">
<h2 id="orgd71ae45">One-dimensional Prefix Sum</h2>
<div class="outline-text-2" id="text-orgd71ae45">
<p>
Given an array \(v\), returns a new array where its \(i\)th element is equal to \(v[0] + v[1] + .. + v[i]\).  The following algorithm solves the problem with \(O(n)\) time and space complexity where \(n\) is the number of elements in the array.
</p>
</div>
</div>

<div id="outline-container-org47006da" class="outline-2">
<h2 id="org47006da"><span class="todo TODO">TODO</span> One-dimensional Prefix Sum using Binary Indexed Tree</h2>
<div class="outline-text-2" id="text-org47006da">
<p>
Useful when the problem requires query and update of the prefix sum.
</p>

<ul class="org-ul">
<li><a href="https://en.wikipedia.org/wiki/Fenwick_tree">Wikipedia</a></li>
<li><a href="https://www.youtube.com/watch?v=CWDQJGaN1gY">Tushar Roy's Fenwick Tree explanation</a></li>
</ul>
</div>
</div>

<div id="outline-container-org811b80c" class="outline-2">
<h2 id="org811b80c">Two-dimensional Prefix Sum</h2>
<div class="outline-text-2" id="text-org811b80c">
<p>
Given a two-dimensional array, returns a new two-dimensional array where each position \((i, j)\) is the sum of all number in the subarray from the position \((0,0)\) to \((i,j)\).  The following code solves the problem with \(O(n \times m)\) time and space complexity.
</p>
</div>
</div>

<div id="outline-container-org84df18f" class="outline-2">
<h2 id="org84df18f">Cited by 1</h2>
<div class="outline-text-2" id="text-org84df18f">
<ul class="org-ul">
<li><a href="matrix.html#ID-0DE29B4D-0B7D-4B34-B370-F5D3193AA932">Matrix</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>